Wire up SSL support, remove nginx webserver and replace with a simple redirect for http to https Add a self signed cert to get SSL up and running immediately
